console.log(0 == null);

/*

0 - это значение какой-либо переменной, которая по умолчанию выдает false.

null - это отсутствие значения у какой-либо переменной, которая также выдает false. Данная величина задается специально при объявление какой-либо переменной.

Если объявить переменную какую-либо переменную, но не задать её значения, то она будет равна undefined, что является тем же самым типом, что и null, который задается специально.

null и undefined - это отсутсвие какой-либо величины, когда 0 - это присутствие величины.

*/